package com.kostanas.pantomine.activities;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.CheckBox;
import android.widget.TextView;
import android.widget.Toast;

import com.kostanas.pantomine.R;

import java.util.ArrayList;
import java.util.Arrays;

/**
 * Created by Anastasios on 3/2/2017.
 */

public class SettingsActivity extends BaseActivity {
    private TextView settingsText, roundTime, totalWins;
    private Button incTime, incWins;
    private Button decTime, decWins;
    private Button continueBtn;
    private int time, wins;
    private boolean isMovies, isSeries;
    private CheckBox chMovies, chSeries;
    private ArrayList<String> movies;

    @Override
    protected void onCreate(Bundle savedInstance){
        super.onCreate(savedInstance);
        setContentView(R.layout.activity_settings);

        time = application.getRoundTime();
        wins = application.getTotalWins();

        settingsText = (TextView) findViewById(R.id.activity_settings_settingsText);
        roundTime = (TextView) findViewById(R.id.activity_settings_setDuration);
        incTime = (Button) findViewById(R.id.activity_settings_increaseTime);
        decTime = (Button) findViewById(R.id.activity_settings_decreaseTime);
        totalWins = (TextView) findViewById(R.id.activity_settings_setWins);
        incWins = (Button) findViewById(R.id.activity_settings_increaseWins);
        decWins = (Button) findViewById(R.id.activity_settings_decreaseWins);
        continueBtn = (Button) findViewById(R.id.activity_settings_continue);
        chMovies = (CheckBox) findViewById(R.id.activity_settings_checkbox_movies);
        chSeries = (CheckBox) findViewById(R.id.activity_settings_checkbox_series);

        isMovies = false;
        isSeries = false;

        application.setWinner(-1);
        roundTime.setText("Χρόνος κάθε ομαδας: " + Integer.toString(time) + "''");
        if (application.isNewGame())
            totalWins.setText("Συνολικές νίκες: " + Integer.toString(wins));
        else{
            settingsText.setText("Ρυθμίσεις συνέχειας παιχνιδιού");
            totalWins.setText("Επιπλέον νίκες: " + Integer.toString(wins));
            chMovies.setVisibility(View.INVISIBLE);
            chSeries.setVisibility(View.INVISIBLE);
        }

        incTime.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                time = time + 10;
                roundTime.setText("Χρόνος κάθε ομαδας: " + Integer.toString(time) + "''");
            }
        });
        decTime.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if (time > 10){
                    time = time - 10;
                    roundTime.setText("Χρόνος κάθε ομαδας: " + Integer.toString(time) + "''");
                }
            }
        });

        incWins.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                wins = wins + 1;
                if (application.isNewGame())
                    totalWins.setText("Συνολικές νίκες: " + Integer.toString(wins));
                else
                    totalWins.setText("Επιπλέον νίκες: " + Integer.toString(wins));

            }
        });
        decWins.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if (wins >1){
                    wins = wins - 1;
                    if (application.isNewGame())
                        totalWins.setText("Συνολικές νίκες: " + Integer.toString(wins));
                    else
                        totalWins.setText("Επιπλέον νίκες: " + Integer.toString(wins));
                }
            }
        });

        chMovies.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                onCheckboxClicked(view);
            }
        });

        chSeries.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                onCheckboxClicked(view);
            }
        });

        continueBtn.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                if ((!isMovies) && (!isSeries) && application.isNewGame()){
                    Toast.makeText(SettingsActivity.this, "Πρέπει να επιλέξετε τουλάχιστον μία κατηγορία.", Toast.LENGTH_SHORT).show();
                }
                else{
                    Intent intent = new Intent(SettingsActivity.this, NewRoundActivity.class);
                    application.setRoundTime(time);

                    if (application.isNewGame()){
                        movies = new ArrayList<>();
                        if (isMovies){
                            movies.addAll(Arrays.asList("Τα 102 σκυλιά της Δαλματίας", "Άγγελοι τιμωροί", "Αγέλαστος πέτρα", "Ο αδερφός 2", "Ο Αυτοκράτορας έχει Κέφια", "Άφθαρτος", "Βλέπω το Θάνατό σου", "Χαζοπούλια", "Χαμένες αγάπες", "Φτηνά τσιγάρα", "Το φως που σβήνει", "Στα σαγόνια του κροκόδειλου", "Πιστά Ερωτευμένοι", "Πορφυρά Ποτάμια", "Πριν πέσει η νύχτα", "Ο Ναυαγός", "Μονομάχος", "Ψάχνοντας την Ντόρι", "Γάμος αλά Ελληνικά 2", "Αφανείς Ηρωίδες", "Τα Μυαλά που Κουβαλάς", "Μαχητές των Δρόμων 7", "Γυναίκα από χρυσό", "Ο λαβύρινθος της σιωπής", "Ο Λαβύρινθος", "Τα Μυστικά του Δάσους", "Εγώ, ο Απαισιότατος 2", "Ελεύθερη πτώση", "Άνθρωπος από ατσάλι", "Ψυχρά κι Ανάποδα", "Παγκόσμιος Πόλεμος Ζ", "Ο Μοναχικός Καβαλάρης", "Η ζωή είναι ωραία με τα μάτια κλειστά", "Καθρέφτη, Καθρεφτάκι Μου", "Οι μάγοι της μπάλας", "Μαδαγασκάρη 3: Οι Φυγάδες της Ευρώπης", "Μαθήματα Ενηλικίωσης", "Μητέρες", "Το μικρό σπίτι στο δάσος", "Τα Μυθικά Πλάσματα του Νότου", "Άκαρδος", "Έρωτας από την Αρχή", "Τακούνια σε... Μυστική Αποστολή", "Ο άγνωστος", "Το άλογο του πολέμου", "Αντίπαλος με τις σκιές 3D: Τελευταίος γύρος", "Απόλυτη ευφυΐα", "Οι Απόγονοι", "Παγιδευμένη Ψυχή", "Παγωμένη λεμονάδα", "Οι Πειρατές της Καραϊβικής: Σε άγνωστα νερά", "Ο Πλανήτης των Πιθήκων: Η Εξέγερση", "Ο Πρώτος Εκδικητής: Captain America", "Η Πυραμμίδα", "Στρουμφάκια", "Η Σιδηρά Κυρία", "Φιλενάδες", "Το τανγκό των Χριστουγέννων", "Αγάπη Σαν Ναρκωτικό", "Οι γυναίκες του τελευταίου ορόφου", "Οι επόμενες τρεις μέρες", "Στην Καρδιά του Χειμώνα", "Σαν το δόλωμα στο αγκίστρι", "Θα Συναντήσεις έναν Ψηλό Μελαχρινό άνδρα", "Το ουρλιαχτό", "Κανένας", "Ο Τελευταίος Μαχητής του Ανέμου", "Το Τελευταίο Τραγούδι", "Το νησί των καταραμένων", "Τρίο", "Παράδεισος στη Δύση", "Περιπλανώμενος", "Η Πρόταση", "Οι σκλάβοι στα δεσμά τους", "Ψηλά στον Ουρανό", "Ένας άντρας μόνος", "Εξολοθρευτής: Η σωτηρία", "Η Εποχή των Παγετώνων 3: Η Αυγή των Δεινοσαύρων", "Έρωτας στην πόλη", "Βρέχει Κεφτέδες",
                                    "Το κατοικημένο νησί", "Καυτά νέα", "Κυνηγώντας ελέφαντες", "Κυνόδοντας", "Η Μούμια", "Σφραγισμένα Χείλη", "Άγριο Κορίτσι", "Πολύ σκληρός για να πεθάνει", "Το ποντικάκι που ήθελε να αγγίξει ένα αστεράκι", "Η Συμμορία των Δεκατριών", "Το φιλί της... Ζωής", "Χαμένα όνειρα", "Καμιά Πατρίδα για τους Μελλοθάνατους", "Ζωή σαν Τριαντάφυλλο", "Η επιστροφή", "Δώσε μου το Χέρι σου", "Πάντα Θα Ξέρω τι Κάνατε Πέρσι το Καλοκαίρι", "Ο Πληροφοριοδότης", "Τα παιδιά των ανθρώπων", "Ο άνεμος χορεύει το κριθάρι", "Ακούγοντας τη σιωπή", "Αδελφές... Ψυχές", "Ο Αδελφός μου ο Αρκούδος 2", "Ξέφρενη ζωή", "Κορίτσι για Σπίτι", "Κρυφές Επιθυμίες", "Ζέστη", "Οι Ζωές των άλλων", "Ζωντανός Θρύλος", "Η Εποχή των Παγετώνων 2: Η Απόψυξη", "Ο Διάβολος Φοράει Prada", "Γύρνα πίσω", "Καληνύχτα, και Καλή Τύχη", "Σήμα Κινδύνου 2", "Αμαρτωλή πόλη", "Όμηρος", "Η τυφλόμυγα", "Μετά την Επόμενη Μέρα", "Περιμένοντας τα Σύννεφα", "Τα Κακά Κορίτσια", "Κακή εκπαίδευση", "Το Φαινόμενο της Πεταλούδας", "Ψάχνοντας τη Χώρα του Ποτέ", "Εγώ, το Ρομπότ", "Ένα σπίτι στο τέλος του κόσμου", "Ημερολόγια Μοτοσικλέτας", "Το Ημερολόγιο", "Η αιώνια λιακάδα ενός καθαρού μυαλού", "Αληθινή ζωή", "Ανοιχτή πληγή", "Οι Απίθανοι", "Οι Ατελείωτοι Αρραβώνες", "Σε βλέπω", "Στα σαγόνια του εχθρού", "Στη Σκιά των Κατασκόπων", "Στο ανώνυμο ύψος", "Η Συμμορία των Δώδεκα", "Τεστοστερόνη", "Οι φύλακες της νύχτας", "Ένα σχολείο πολύ ροκ", "Οι Ονειροπόλοι", "Οξυγόνο", "Εγώ δεν φοβάμαι", "Το Γλυκό στο Τέλος", "Χαμένοι στη Μετάφραση", "Το Χαμόγελο της Μόνα Λίζα", "Χάρτινος κόσμος", "Ψάχνοντας τον Νέμο", "Ο Αδελφός μου ο Αρκούδος", "Ο άρχοντας των Δαχτυλιδιών: Η Επιστροφή του Βασιλιά", "Πολίτικη κουζίνα", "Μ' αγαπά, δεν μ' αγαπά", "Ο Πλανήτης των Θησαυρών", "Κεραυνοβόλος Έρωτας", "Οι Κόρες της Ντροπής", "Χωρίς ταυτότητα", "Σπιρτόκουτο", "Η Μούμια επιστρέφει", "Ωραία μέρα για να πεθάνεις", "Ο Χορός των Τεράτων", "Το κλάμα βγήκε από τον παράδεισο", "Η Εκδίκηση της Ξανθιάς",
                                    "Ένας Υπέροχος άνθρωπος", "Εχθρός προ των Πυλών", "Μυστικά της Κρεβατοκάμαρας", "Μάτια Ερμητικά Κλειστά", "Ο Μύθος του Ακέφαλου Καβαλάρη", "Η Έκτη Αίσθηση", "Η επίθεση του γιγαντιαίου μουσακά", "Ο Χιονάνθρωπος", "Ξέρω τι Κάνατε Πέρυσι το Καλοκαίρι", "Το τρίο της χαράς", "Μοντέλο για Φόνο", "Ο Ταχυδρόμος χτυπά πάντα δυο φορές", "Ο Ηλίθιος και ο Πανηλίθιος", "Μαθήματα Πιάνου", "Άρωμα Γυναίκας", "Ο Θάνατος Σου Πάει Πολύ", "Βασικό Ένστικτο", "Κραυγή από το Διάστημα", "Η Σιωπή των Αμνών", "Η Μικρή Γοργόνα", "Ο Κύκλος των Χαμένων Ποιητών", "Αόρατος εραστής", "Ο Ψαλιδοχέρης", "Χορεύοντας με τους Λύκους", "Μόνος στο Σπίτι", "Ο Νονός", "Πολύ σκληρός για να πεθάνει", "Η Μεταμόρφωση", "Εργαζόμενο Κορίτσι", "Γυναίκες στα πρόθυρα νευρικής κρίσης", "Εφιάλτης στο Δρόμο με τις Λεύκες", "Δωμάτιο με Θέα", "Ο Μελισσοκόμος", "Σούπερμαν 4: Η Aναζήτηση για την Ειρήνη", "Στενές Επαφές Τρίτου Τύπου", "Τραγουδώντας στη Βροχή", "Ο Βιολιστής στη Στέγη", "Οργισμένο Είδωλο", "Όλα για τη Μητέρα μου", "Ο Πρωτάρης", "Ξέγνοιαστος Καβαλάρης", "Δόκτωρ Ζιβάγκο", "Η Νύχτα των Ζωντανών Νεκρών", "Ο Λαβύρινθος", "Ο Καλόσαυρος", "Μπομπ Σφουγγαράκης Εξω απ' τα νερά του", "Η γέφυρα των Κατασκόπων", "Μόνος στο διάστημα", "Λυσσασμένες στα νύχια του τρόμου", "Η κρυφή γοητεία της μπουρζουαζίας", "Οι νύμφες των πάγων στο λυκόφως", "Ο πρίγκηπας της παλίρροιας", "Μακελειό στο δάσος της φρίκης", "Ο άνεμος χορεύει το κριθάρι", "Εγκέφαλος με βίδα και βαλβίδα", "Έρωτας στη χουρμαδιά", "Χάρισέ μου το γουνάκι σου", "3 μάγκες στο παρθεναγωγείο", "Η επίθεση του γιγάντιου μουσακά", "Αχτύπητα καμάκια", "Για ένα ταγάρι δολάρια", "Ο σπαγγοραμένος", "Τζιπ, περίπτερο κι αγάπη", "Πες τα βρωμόστομε", "Το ακρογιάλι με τις ανώμαλες", "Το Σινικό τείχος", "Αντίδοτο στην ευεξία", "Κάτω από την άμμο", "Η ταινία LEGO Batman", "50 αποχρώσεις του γκρι", "50 πιο σκοτεινές αποχρώσεις του γκρι", "Μοντέρνοι Καιροί", "Matrix", "Το Κουρδιστό Πορτοκάλι", "Ο Ταξιτζής",
                                    "Οι Κυνηγοί της Χαμένης Κιβωτού", "Τιτανικός", "Ο Άρχοντας των Δαχτυλιδιών: Η Συντροφιά του Δαχτυλιδιού", "Όσα Παίρνει ο Άνεμος", "Ο Πόλεμος των Άστρων", "Αποκάλυψη Τώρα", "Ωραία μου Κυρία", "Μια θέση στον ήλιο", "Κάτω από έναν Άλλον Ήλιο", "Η Αιχμάλωτη της Ερήμου", "Μία Νύχτα στην Όπερα", "Ο Ελαφοκυνηγός", "Η ταχυδρομική άμαξα", "Οι Δύο Ληστές", "Τα σαγόνια του καρχαρία", "Κινγκ Κονγκ (King Kong)", "Στη σκιά των τεσσάρων γιγάντων", "Το τρένο θα σφυρίξει τρεις φορές", "Η βασίλισσα της Αφρικής", "Σπάρτακος", "Η Τελευταία Παράσταση", "Η Λεωφόρος της Δύσης", "Στη Φωλιά του Κούκου", "Ο Καουμπόι του Μεσονυχτίου", "Οι Δώδεκα Ένορκοι", "Ε.Τ. ο Εξωγήινος", "Τα Σταφύλια της Οργής", "Ο Νευρικός Εραστής", "Άγρια Συμμορία", "Η Χιονάτη και οι Επτά Νάνοι", "Η Γέννηση ενός Έθνους", "Σκιές και Σιωπή", "Θα σε δώ στην κόλαση αγάπη μου", "Η ανταλλαγή", "12 χρόνια σκλάβος", "Ο ψευταράς", "Άκρως τρελό και απόρρητο", "Το δέντρο της ζωής", "Η αρπαχτή", "Ο χορός των κατασκόπων", "Οδηγός αισιοδοξίας", "Ανίκητος", "Στην άκρη του νήματος", "Επαναστάστης χωρίς αιτία", "Τρέξε γρήγορα", "Ποτέ δεν είναι αργά", "Η ομίχλη", "Δια πυρός και σιδήρου", "Επικίνδυνο πάθος", "Ζητείται ψεύτης", "Η πιο σκοτεινή ώρα", "Σινεμά ο παράδεισος", "Ο άνθρωπος που πούλησε τον κόσμο", "Λουκουμάδες με μέλι", "Ο λόγος του Βασιλιά", "Παιχνίδια συνωμοσίας", "Ο άνθρωπος της βροχής", "Πεθερικά της συμφοράς", "Μάθε παιδί μου γράμματα", "Όλα θα πάνε καλά", "Η χαρά και η Θλίψη του Σώματος", "Παράδεισος της Πίστης", "Ο χαμένος τα παίρνει όλα", "Καλύτερα δεν γίνεται", "Ασανσέρ για δολοφόνους", "Ο έρωτας είναι το τέλειο έγκλημα", "Ο δρόμος του χρήματος", "Οι εργένισσες", "Χάρηκα που σε γνώρισα", "Ένας χρόνος είναι αρκετός", "Δημόσιος κίνδυνος", "Το πράσινο μίλι", "Γείτονες σε περιπολία", "Αυστηρώς κατάλληλο", "Πέντε λεπτά ακόμα", "Τρεις ήρωες", "Το παιδί με το ποδήλατο", "Άδικος κόσμος", "Αμφιβολία", "Η αόρατη γυναίκα", "Επικίνδυνες μαγειρικές", "Στενά περιθώρια",
                                    "Μια επικίνδυνη μέθοδος", "Το αγόρι στο τελευταίο θρανίο", "Το βασίλειο των ουρανών", "Φόνος στην ομίχλη", "Η γεύση της Εκδίκησης", "Παράδεισος του Έρωτα", "Πριν ο διάβολος καταλάβει ότι πέθανες", "Η κλέφτρα των βιβλίων", "Τηλεφωνικός θάλαμος", "Και μόνο την αλήθεια", "Ο πατριώτης", "Το ακρωτήρι του φόβου", "Οι άλλοι", "Ένας χωρισμός", "Ο κανόνας της σιωπής", "Ημέρα εκπαίδευσης", "Ανεμοδαρμένα ύψη", "Οι άνδρες με τα μαύρα 3", "Πιάσε με αν μπορείς", "Δεν κρατιέμαι", "Το σπίτι στο τέλος του δρόμου", "Νήσος", "Το απαγορευμένο ποδήλατο", "Ο φύλακας του σκότους", "Οι συνήθεις ύποπτοι", "Άλλη μια νύχτα", "Η γυναίκα με τα μαύρα", "Ακραίες καταστάσεις", "Η κληρονόμος", "Τα ιπτάμενα στιλέτα", "Γαμήλιο πάρτυ", "Σκοτεινό ποτάμι", "Ο δικηγόρος του διαβόλου", "Νύχτα γεμάτη έρωτα", "Μαύρος κύκνος", "Δεσμά αίματος", "Ο κλέφτης των ποδηλάτων", "Το κορίτσι με το τατουάζ", "Αιώνιο φοιτητής", "Ο σκοτεινός ιππότης", "Πέντε δευτερόλεπτα στο κενό", "Παιχνίδι θανάτου", "Παίζοντας με την αγάπη", "Ο σημαδεμένος", "Το καταφύγιο", "Το κυνήγι της ευτυχίας", "Η ψυχή στο στόμα", "Πολύ σκληρός για να πεθάνει σήμερα", "Ο υποκινητής", "Πεθαίνοντας για την αλήθεια", "Η αγάπη έρχεται στο τέλος", "Πώς να κλέψετε ένα εκατομμύριο δολάρια", "Έγκλημα στη λίμνη", "Αυτή η νύχτα μένει", "Ο δικτάτορας", "Ματωμένο διαμάντι", "Πριν τα μεσάνυχτα", "Ο Θεός της σφαγής", "Αναζητώντας ένα φιλί τα μεσάνυχτα", "Επτά ζωές", "Επιθυμίες.. στο παρά πέντε", "Ο τιμωρός", "Επτά ψυχοπαθείς", "Ανοιχτοί λογαριασμοί", "Ταξίδι στην άγριο φύση", "Ήμασταν κάποτε στρατιώτες", "Καυτό απόρρητο", "Υπηρέτριες", "Καυτοί και άσφαιροι", "Η μαγική ομπρέλα", "Ο δολοφόνος με το πριόνι", "Εκεί που δεν το περιμένεις", "Σιωπηλό σπίτι", "Επικίνδυνες υποσχέσεις", "Ρόδα, τσάντα και κοπάνα", "Το τέλειο χτύπημα", "Τι να περιμένεις όταν είσαι έγκυος", "Ναι σε όλα", "Μια χειμωνιάτικη ιστορία", "Οι αδιάφθοροι", "Κουράστηκα να σκοτώνω τους αγαπητικούς σου", "Αυτό θα πει πόλεμος", "Ο δρόμος της απώλειας",
                                    "Κοτόπουλο με δαμάσκηνα", "Υποψίες", "Η λάμψη", "Ξέχασέ το", "Είναι όλοι τους καλά", "Ένας προφήτης μα τι προφήτης"));
                        }
                        if (isSeries){
                            movies.addAll(Arrays.asList("Δανεικός πατέρας", "Διπλανή πόρτα", "Δύο ξένοι", "Για σένα", "Είμαστε στον αέρα", "Η αγάπη άργησε μια μέρα", "Και οι παντρεμένοι έχουν ψυχή", "Καραμπόλα", "Καρέ της Ντάμας", "Ο κακός Βεζίρης", "Οι αθώοι της πτέρυγας 5", "Τα καλά παιδιά ξανάρχονται", "Το τίμημα του πάθους", "Το χρήμα στο λαιμό σας", "Ψίθυροι καρδιάς", "Θα σε δω στο πλοίο", "Και πάλι φίλοι", "Κάτι τρέχει με τους δίπλα", "Κωνσταντίνου και Ελένης", "Σ’ αγαπώ – μ’ αγαπάς", "Φιλί ζωής", "Το καφέ της Χαράς", "Το Κόκκινο Δωμάτιο", "Οι τρεις φίλες", "Πάλι από την αρχή", "Ευτυχισμένοι μαζί", "Ζωή ξανά", "Ιστορίες από την απέναντι όχθη", "Φίλα το βάτραχο σου", "Το κλειδί του παραδείσου", "Το σόι μου μέσα", "Πενήντα πενήντα", "Με τα παντελόνια κάτω ", "10η Εντολή", "Τρελή οικογένεια", "9 Μήνες", "Δίδυμα φεγγάρια", "Κάτω Παρτάλι", "Καλές δουλειές", "Επιστροφή στον Πλανήτη των Πιθήκων", "Ζήνα", "Η Ζώνη του Λυκόφωτος", "Ο Θεός ξέχασε τον Παράδεισο", "Ιατρικές Υποθέσεις", "Μέρες αγάπης", "Οι Μάγισσες", "Νόμος και Τάξη: Ειδική Ομάδα", "Νοικοκυρές Σε Απόγνωση", "Οι Επιζήσαντες", "Όλα του γάμου δύσκολα", "Πράκτορας... Στο Τσακ", "Παντρεμενοι με παιδιά", "Σούπερμαν: Τα Χρόνια της Νιότης", "Στην Εντατική", "Στον Έβδομο Ουρανό", "Τόλμη και Γοητεία", "Το Τσίρκο του Μυστηρίου", "Φίλοι για πάντα", "Τα Φιλαράκια", "Χαβάη 5-0", "Χαμένοι στο διάστημα", "Οι Αγνοούμενοι", "Απόλυτη Ευφυΐα", "Ατίθασα νιάτα", "Γάμος... αλά Ελληνικά: Εφτά Επεισόδια Φαγούρα!", "Το διάλειμμα", "Ήρωες με πυτζάμες", "Μαύρη Οχιά", "Ασυνήθεις ύποπτοι", "Βαμμένος ήλιος", "Μία νύχτα σαν και αυτή", "Εκείνες κι εγώ", "Καληνύχτα μαμά", "Λόγω τιμής", "Ο Ιός του πατέρα", "Το χρώμα του φεγγαριού", "Τα χρώματα της αγάπης", "Οι δικοί μας άνθρωποι", "Ατρόμητοι", "Άγγιγμα ψυχής", "Απαγορευμένη Αγάπη", "Μοιραίο πάθος", "Οι Μεν Και Οι Δεν", "Πάτερ ημών", "Ρακοσυλλέκτες", "Στην κόψη του ξυραφιού", "Ταύρος με Τοξότη", "Τμήμα Ηθών", "Το τελευταίο αντίο", "Η αγία τετράδα",
                                    "Το κόκκινο φανάρι του μυστήριου δρόμου", "Το μάτι του φιδιού", "Τολμηρές ιστορίες", "Χαμένη Άνοιξη", "Σκιές πάνω από την πόλη", "Μάνα είναι μόνο μία", "Παντρεμένοι ανύπαντροι", "Το γελοίον του πράγματος", "Ο χήρος, η χήρα και τα χειρότερα", "Εσύ αποφασίζεις", "Οι χλιδάτοι", "Όταν ήμουν δάσκαλος", "Παράθυρο στον ήλιο", "Το γαλάζιο διαμάντι", "Θα μιλήσεις με το δικηγόρο μου", "Και οι 4 ήταν υπέροχες", "Οι μικρομεσαίοι", "Συγκάτοικοι στην τρέλα", "Συμφωνία σιωπής", "Τμήμα Ηθών", "Τα μπακούρια", "Το δέκατο τρίτο κιβώτιο", "Το μινόρε μιας καρδιάς", "Το σόι σου", "Το τίμημα", "Το τραγούδι της αγάπης", "Φως και Σκιά", "Όλα για την αγάπη", "Αύριο είναι η άνοιξη", "Η άσχημη που έγινε όμορφη", "Η αγάπη ποτέ δεν πεθαίνει", "Ο Θρίαμβος της Αγάπης", "Μαρία η άσχημη", "Σαββατογεννημένες", "Μαύρα μεσάνυχτα", "Safe sex", "Εραστής δυτικών προαστίων", "Είσαι το ταίρι μου", "Η πολυκατοικία", "Παρά πέντε", "Μοντέρνα οικογένεια", "Οι απαράδεκτοι", "Εθνική Ελλάδος", "Λατρεμένοι μου γείτονες", "Οι βασιλιάδες", "Τι ψυχή θα παραδώσεις μωρή", "Κανείς δεν λέει σ'αγαπώ", "Βέρα στο δεξί", "Δέκα λεπτά κήρυγμα", "Πίσω στο σπίτι", "Μαζί σου", "Πολυθρόνα για τρείς", "Η ζωή της άλλης", "Η οικογένεια βλάπτει", "Εμείς κι εμείς", "Επτά θανάσιμες πεθερές", "Η νταντά", "Κλεμμένα όνειρα", "Γοργόνες", "Παιδική χαρά", "Τα άγρια παιδιά", "Περί ανάμων και Υδάτων", "Ήρθε και έδεσε", "Η απλή μέθοδος των τριών", "Ένας μήνας και κάτι", "Μια στιγμή δυο ζωές", "Χαρά αγνοείται", "Μπαμπά μην Τρέχεις", "Οι Αταίριαστοι", "Αν υπήρχες θα σε χώριζα", "Απόσταση Αναπνοής", "Φάε τη Σοκολάτα σου", "Άλλη το πρωί Άλλη το βράδυ", "Ρουά Ματ", "Η Εκδρομή", "Μίλα μου βρώμικα", "Η γενιά των 592 ευρώ", "Ο πόλεμος των άστρων", "Το δαχτυλίδι της φωτιάς", "Εργαζόμενη γυναίκα", "Τα κορίτσια του μπαμπά", "Δεληγιάννειον Παρθεναγωγείον", "Εντιμότατοι... κερατάδες", "Της αγάπης μαχαιριά", "Θα βρεις το δάσκαλο σου", "Η ώρα η καλή", "Σαν το σκύλο με τη γάτα", "Χορεύοντας στη σιωπή",
                                    "Βότκα πορτοκάλι", "Κόκκινος κύκλος", "Αστέρας ραχούλας", "Μάλιστα, Σεφ!", "Οι συμμαθητές", "Έλα στη θέση μου", "Μην αρχίζεις τη μουρμούρα", "Η χειρότερη εβδομάδα της ζωής μου", "Εγκλήματα", "Σοφία ορθή", "Πόσο γλυκά με σκοτώνεις", "Οικογενειακές ιστορίες", "Ο τέλειος άνδρας", "Καλά να πάθεις", "Οι αναιδέστατοι", "Λούφα και παραλλαγή", "Με θέα στο πέλαγο", "Η τελευταία παράσταση", "Οδός παραδείσου 7", "Γάμος με τα όλα του", "Μια θέση στον ήλιο", "Έχω ένα μυστικό", "Το σπίτι δίπλα στη θάλασσα", "Χαϊδεμένα παιδιά", "Μόνο εσύ", "Ψεύτης παππούς", "Πλάκα μου κάνεις", "Η αγάπη ήρθε από μακρυά", "504 χιλιομετρα βόρειας της Αθήνας", "Υπάρχουν άντρες και άντρες", "Η φωνή", "Πες το ψέματα", "Η τράπεζα", "Μικρές αμαρτίες", "Ιστορία αγάπης", "Σύνορα αγάπης", "Η λίμνη των στεναγμών", "Οι γυναίκες της ζωής της", "Η αίθουσα του θρόνου", "Τα παιδιά της γειτονιάς", "Δυο μέρες μόνο", "Ντάμας", "Ίχνη", "Θύματα ειρήνης", "Κρυφά μονοπάτια", "Κλεμμένη ζωή", "Ακροβατώντας", "Ασθενείς και οδοιπόροι", "Κάρμα", "Ανίσχυρα ψεύδη", "Ματωμένα χώματα", "Χωρίς όρια", "Αχ! Και να ξερες", "Όρκος σιωπής", "Για μια γυναίκα και ένα αυτοκίνητο", "Μυστικές διαδρομές", "Ο γητευτής", "Στη σκιά του πολέμου", "Όλα στον αέρα", "Μείνε δίπλα μου", "Κλινική περίπτωση", "Η σιωπή των αγγέλων", "Ελλάς το μεγαλείο σου", "Κινούμενη άμμος", "Η μάχη των φύλων", "Βαλς με 12 Θεούς", "Στο δρόμο της καρδιάς", "Ο άγγελος μου ο διάβολος μου", "Τα μυστικά της Εδέμ", "Ας πρόσεχες", "Μάνα Χ ουρανού", "Πάνω από το νόμο", "Ερωτευμένος άγγελος", "Δείξε μου τον φίλο σου", "Σφηνάκια", "Ο Ιούδας φιλούσε υπέροχα", "Με δύο μαμάδες", "Σκυλίσια ζωή", "Πες μου ναι", "Τύχη βουνό", "Μέχρι τρεις είναι δεσμός", "Αθώος ή ένοχος", "Δακρυσμένα φεγγάρια", "Αντίστροφη μέτρηση", "30 ημέρες αγωνίας", "Στα φτερά του έρωτα", "Αέρινες σιωπές", "Μη μασάς το παραμύθι", "Με διαφορά στήθους", "Διακοπή για διαφημίσεις", "Δια ταύτα"));
                        }

                        application.setMovies(movies);
                    }
                    if (!application.isNewGame())
                        wins = wins + application.getTotalWins();
                    application.setTotalWins(wins);
                    intent.setFlags(Intent.FLAG_ACTIVITY_CLEAR_TOP);
                    startActivity(intent);
                    finish();
                }
            }
        });
    }

    public void onCheckboxClicked(View view) {
        // Is the view now checked?
        boolean checked = ((CheckBox) view).isChecked();

        // Check which checkbox was clicked
        switch(view.getId()) {
            case R.id.activity_settings_checkbox_movies:
                if (checked)
                    isMovies = true;
                else
                    isMovies = false;
                break;
            case R.id.activity_settings_checkbox_series:
                if (checked)
                    isSeries = true;
                else
                    isSeries = false;
                break;
        }
    }
}
